In [99]:
import pandas as pd

In [100]:
#1-1
data={'이름':['메로나', '비비빅', '죠스바'],
    '가격':[300, 400, 250],
    '재고': [20, 3, 100]}
data_DF=pd.DataFrame(data)
data_DF

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [115]:
#1-2
print(data_DF.index, 
data_DF.columns,
data_DF.values,
data_DF.dtypes,
data_DF.shape, 
data_DF.ndim, sep='\n')

Index(['일', '이', '삼', '사'], dtype='object')
Index(['이름', '가격', '재고', '총가격'], dtype='object')
[['메로나' 300 20 0]
 ['비비빅' 400 23 0]
 ['죠스바' 250 100 0]
 ['빵빠레' 550 23 0]]
이름     object
가격      int64
재고      int64
총가격     int64
dtype: object
(4, 4)
2

In [102]:
#1-3
data_DF.가격

0    300
1    400
2    250
Name: 가격, dtype: int64

In [103]:
#1-4
data_DF[data_DF.columns[::2]]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [104]:
#1-5
data_DF.iloc[1]

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object

In [105]:
#1-6
data_DF.iloc[::2]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

In [106]:
#1-7
data_DF.index=['일', '이', '삼']
data_DF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [107]:
#1-8
data_DF['총가격']=0
data_DF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [108]:
#1-9
data_DF.loc['사']=('빵빠레',550, 23, 0) 
data_DF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   23    0

In [109]:
#1-10
data_DF.loc['이', '재고']=23
data_DF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   23    0

In [110]:
#2-1
data = [ [ 2000, 3050, 2050, 1980], 
[ 7500, 2050, 2050, 1980],
[15450, 15050, 15550, 14900]
]
data_DF2= pd.DataFrame(data, columns=[
    '시가', '고가', '저가', '종가'])

In [111]:
print(data_DF2.index,
data_DF2.column,
data_DF2.shape,
data_DF2.dtype,
data_DF2.ndim,

)

AttributeError: 'DataFrame' object has no attribute 'column'

In [ ]:
#2-3
data_DF2.index=['2024-01-01', '2021-02-01', '2024-03-01']
data_DF2

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2021-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [ ]:
# 2-4
data_DF2.columns=['open', 'high', 'low','close']
data_DF2

             open   high    low  close
2024-01-01   2000   3050   2050   1980
2021-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [ ]:
# 2-5
data_DF2[data_DF2.columns[1::2]]

      고가     종가
0   3050   1980
1   2050   1980
2  15050  14900

In [ ]:
#2-6
data_DF2.loc['2024-04-01']=[3200,3550,3000,2990]
data_DF2

             open   high    low  close
2024-01-01   2000   3050   2050   1980
2021-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [ ]:
#2-7
data_DF2.drop(index='2024-01-01')

             open   high    low  close
2021-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [ ]:
#2-8
data_DF2.loc['2024-03-01', 'low']=14000
data_DF2

                 시가       고가       저가       종가  (2024-03-01, low)      low
0            2000.0   3050.0   2050.0   1980.0            14000.0      NaN
1            7500.0   2050.0   2050.0   1980.0            14000.0      NaN
2           15450.0  15050.0  15550.0  14900.0            14000.0      NaN
2024-03-01      NaN      NaN      NaN      NaN                NaN  14000.0

In [112]:
#2-9

3-1: 데이터
3-2 DataFrame
3-3 Series
3-4 DataFrame
3-5 array
3-6 Series
3-7 Series
3-8 DataFrame